       IDENTIFICATION DIVISION.
       PROGRAM-ID.    SALESRPT.
       AUTHOR.        A. VAZQUEZ.
       DATE-WRITTEN.  08/1/2026.

      ****************************************************************
      *                                                              *
      *  PROGRAM NAME:      SALESRPT.                                *
      *                                                              *
      *  PURPOSE:                                                    *
      *                                                              *
      *                                                              *
      *  INPUT:                                                      *
      *                                                              *
      *  OUTPUT:                                                     *
      *                                                              *
      *  ENTRY CONDITION:                                            *
      *                                                              *
      *                                                              *
      *  EXIT CONDITION:                                             *
      *                                                              *
      *  NOTES:                                                      *
      *                                                              *
      *                                                              *
      ****************************************************************


      ****************************************************************
       ENVIRONMENT DIVISION.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.

           SELECT FUND-FILE
               ASSIGN TO FUNDFILE
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS WS-FUND-FILE-STATUS.

           SELECT PRICE-FILE
               ASSIGN TO PRCFILE
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS WS-PRICE-FILE-STATUS.

           SELECT SALES-FILE
               ASSIGN TO SALEFILE
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS WS-SALES-FILE-STATUS.

           SELECT HIGH-SALES-FILE
               ASSIGN TO HIGHSLS
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS WS-HIGH-SALES-FILE-STATUS.

           SELECT REPORT-FILE
               ASSIGN TO REPORTFL
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS WS-REPORT-FILE-STATUS.


      ****************************************************************
       DATA DIVISION.
       FILE SECTION.

       FD  FUND-FILE
           RECORDING MODE IS F
           RECORD CONTAINS 80 CHARACTERS.

      *     COPY FUNDREC.
       01  FUND-RECORD.
           05  IN-FUND-NBR        PIC S9(3).
           05  IN-FUND-NME        PIC X(25).
           05  IN-FUND-COMM-PCT   PIC S9(3)V9(3).

           05  FILLER             PIC X(46).



       FD  PRICE-FILE
           RECORDING MODE IS F
           RECORD CONTAINS 80 CHARACTERS.

      *     COPY PRCREC.
       01  PRICE-RECORD.
           05  IN-FUND-SHR-PRC    OCCURS 3
                                  PIC S9(3)V99.
           05                     PIC X(65).



       FD  SALES-FILE
           RECORDING MODE IS F
           RECORD CONTAINS 102 CHARACTERS.

      *     COPY SALESREC.
       01  SALES-RECORD.
           05  SALE-BRANCH-NME          PIC X(20).
           05  SALE-BROKER-NME          PIC X(25).
           05  SALE-DETAIL              OCCURS 4
                                        INDEXED BY SALE-NDX.
               10  SALE-FUND-NBR        PIC S9(3).
               10  SALE-SHR-PRC-FLG     PIC S9.
               10  SALE-DEP-AMT         PIC S9(8)V99.
           05                           PIC X.



       FD  HIGH-SALES-FILE
           RECORDING MODE IS F
           RECORD CONTAINS 34 CHARACTERS.

      *   COPY HSREC.
       01  HIGH-SALES-RECORD.
           05  HS-BROKER-NME         PIC X(25).
           05  HS-FUND-NBR           PIC S9(3)       PACKED-DECIMAL.
           05  HS-SHR-AMT            PIC S9(10)V9(3) PACKED-DECIMAL.



       FD  REPORT-FILE
           RECORDING MODE IS F
           RECORD CONTAINS 132 CHARACTERS.

       01  REPORT-RECORD                 PIC X(132).


       WORKING-STORAGE SECTION.

      ****************************************************************
      *  FILE STATUS FIELDS                                          *
      ****************************************************************

      * GENERAL FOR INDEX
       01  I                             PIC S9(4) BINARY VALUE ZERO.

       01  WS-END-OF-FILE                PIC X VALUE 'N'.
      *                                  FIRST VALUE IS USED FOE TRUE
           88 END-OF-FILE                VALUE 'Y'.
           88 NOT-END-OF-FILE            VALUE 'N'.

       01  WS-FUND-FILE-STATUS           PIC XX VALUE SPACES.
           88  FUND-FILE-OK              VALUE '00'.
           88  FUND-FILE-AT-END          VALUE '10'.

       01  WS-PRICE-FILE-STATUS          PIC XX VALUE SPACES.
           88  PRICE-FILE-OK             VALUE '00'.
           88  PRICE-FILE-AT-END         VALUE '10'.

       01  WS-SALES-FILE-STATUS          PIC XX VALUE SPACES.
           88  SALES-FILE-OK             VALUE '00'.
           88  SALES-FILE-AT-END         VALUE '10'.

       01  WS-HIGH-SALES-FILE-STATUS     PIC XX VALUE SPACES.
           88  HIGH-SALES-FILE-OK        VALUE '00'.
           88  HIGH-SALES-FILE-AT-END    VALUE '10'.

       01  WS-REPORT-FILE-STATUS         PIC XX VALUE SPACES.
           88  REPORT-FILE-OK            VALUE '00'.

      ****************************************************************
      *  FUND TABLE                                                   *
      ****************************************************************
       01  WS-FUND-COUNT                 PIC S9(4) BINARY SYNC
                                         VALUE ZERO.

       01  WS-FUND-TABLE.
           05  TBL-FUND-ENTRY
      *          initial buffer
               OCCURS 1 TO 199 TIMES
      *          WS-FUND-COUNT so search knows how far to look at
               DEPENDING ON WS-FUND-COUNT
      *          set the pk
               ASCENDING KEY IS TBL-FUND-NBR
      *          set curson name
               INDEXED BY TBL-FUND-NDX.

      *         COPY FUNDTBL.
               10  TBL-FUND-NBR        PIC S9(3)      PACKED-DECIMAL.
               10  TBL-FUND-NME        PIC X(25).
               10  TBL-FUND-COMM-PCT   PIC S9(3)V9(3) PACKED-DECIMAL.
               10  TBL-FUND-SHR-PRC    OCCURS 3
      *                                fixed to 3 no depends, cursor on
                                       INDEXED BY TBL-PRC-NDX
                                       PIC S9(3)V99   PACKED-DECIMAL.


      ****************************************************************
      *                       SALES REPORT                           *
      ****************************************************************

      ** REPORT STATE **
       01  WS-LINE-COUNT    PIC S9(4) BINARY         VALUE ZERO.
       01  WS-PAGE-COUNT    PIC 9(4)  PACKED-DECIMAL VALUE ZERO.
       01  WS-BLANK-ROW               PIC X(132)     VALUE SPACES.

      *  HEADING LINE 1
       01 WS-COLUMN-HEADER-1.
          05 FILLER PIC X(82) VALUE SPACES.
          05 FILLER PIC X(14) VALUE '       DEPOSIT'.
          05 FILLER PIC X(22) VALUE SPACES.
          05 FILLER PIC X(14) VALUE '    COMMISSION'.

      *  HEADING LINE 2
       01 WS-COLUMN-HEADER-2.
          05 FILLER PIC X(21) VALUE 'BRANCH NAME'.
          05 FILLER PIC X(2)  VALUE SPACES.
          05 FILLER PIC X(25) VALUE 'BROKER NAME'.
          05 FILLER PIC X     VALUE SPACE.
          05 FILLER PIC X(4)  VALUE 'FUND'.
          05 FILLER PIC X(2)  VALUE SPACES.
          05 FILLER PIC X(25) VALUE 'FUND NAME'.
          05 FILLER PIC X(2)  VALUE SPACES.
          05 FILLER PIC X(14) VALUE '        AMOUNT'.
          05 FILLER PIC X(4)  VALUE SPACES.
          05 FILLER PIC X(16) VALUE '     SHARES SOLD'.
          05 FILLER PIC X(2)  VALUE SPACES.
          05 FILLER PIC X(14) VALUE '        AMOUNT'.

      *  COLUMN HYPHEN LINE                                          *
       01  WS-COLUMN-HYPHENS.
           05 FILLER PIC X(21) VALUE '---------------------'.
           05 FILLER PIC X(2)  VALUE SPACES.
           05 FILLER PIC X(25) VALUE '-------------------------'.
           05 FILLER PIC X     VALUE SPACE.
           05 FILLER PIC X(4)  VALUE '----'.
           05 FILLER PIC X(2)  VALUE SPACES.
           05 FILLER PIC X(25) VALUE '-------------------------'.
           05 FILLER PIC X     VALUE SPACE.
           05 FILLER PIC X(15) VALUE '---------------'.
           05 FILLER PIC X(2)  VALUE SPACES.
           05 FILLER PIC X(18) VALUE '------------------'.
           05 FILLER PIC X     VALUE SPACE.
           05 FILLER PIC X(15) VALUE '---------------'.

      *  REPORT DETAIL LINE                                          *
       01 WS-DETAIL-LINE.
          05 WS-DTL-BRANCH-NME         PIC X(21).
          05 FILLER                    PIC X(2).
          05 WS-DTL-BROKER-NME         PIC X(25).
          05 FILLER                    PIC X.
          05 WS-DTL-FUND-NBR           PIC ZZZ9.
          05 FILLER                    PIC X(2).
          05 WS-DTL-FUND-NME           PIC X(25).
          05 FILLER                    PIC X(2).
          05 WS-DTL-DEP-AMT            PIC $$$,$$$,$$9.99.
          05 FILLER                    PIC X(4).
          05 WS-DTL-SHARE-AMT          PIC ZZZ,ZZZ,ZZ9.9999.
          05 FILLER                    PIC X(2).
          05 WS-DTL-COMMISSION-AMT     PIC $$$,$$$,$$9.99.


       LOCAL-STORAGE SECTION.


      ****************************************************************
       PROCEDURE DIVISION.

       000-MAIN.

           DISPLAY 'SALESRPT 8 STARTING... V1'.

      *    OPEN FILES
           PERFORM 100-OPEN-FUNDS-FILE.
           PERFORM 110-OPEN-PRICES-FILE.
           PERFORM 120-OPEN-SALES-FILE.
           PERFORM 130-OPEN-REPORT-FILE.

      *    BUILD FUND/FUND PRICE TABLE
           PERFORM 300-PROCESS-FUND-PRICE-TABLE.
           PERFORM 320-PROCESS-SALES-TABLE.

           STOP RUN.


       100-OPEN-FUNDS-FILE.

           DISPLAY 'OPENING FUNDS FILE...'.

           OPEN INPUT FUND-FILE.
           IF NOT FUND-FILE-OK
              DISPLAY 'FATAL: FUND-FILE OPEN ERROR '
                   WS-FUND-FILE-STATUS
              STOP RUN
           END-IF.


       110-OPEN-PRICES-FILE.

           DISPLAY 'OPENING PRICES FILE...'.

           OPEN INPUT PRICE-FILE .
           IF NOT PRICE-FILE-OK
              DISPLAY 'FATAL: PRICE-FILE OPEN ERROR '
                   WS-PRICE-FILE-STATUS
              STOP RUN
           END-IF.


       120-OPEN-SALES-FILE.

           DISPLAY 'OPENING SALES FILE...'.

           OPEN INPUT SALES-FILE .
           IF NOT SALES-FILE-OK
              DISPLAY 'FATAL: SALE-FILE OPEN ERROR '
                   WS-SALES-FILE-STATUS
              STOP RUN
           END-IF.


       130-OPEN-REPORT-FILE.

           DISPLAY 'OPENING REPORT FILE...'.

           OPEN OUTPUT REPORT-FILE.
           IF NOT REPORT-FILE-OK
              DISPLAY 'FATAL: REPORT-FILE OPEN ERROR '
                   WS-REPORT-FILE-STATUS
              STOP RUN
           END-IF.


       300-PROCESS-FUND-PRICE-TABLE.

           DISPLAY "BUILDING FUND-PRICE TABLE ".

           MOVE 0 TO WS-FUND-COUNT.

           MOVE 'N' TO WS-END-OF-FILE.
           PERFORM UNTIL END-OF-FILE
              READ FUND-FILE
                  AT END
                      SET END-OF-FILE TO TRUE
                  NOT AT END

                  PERFORM 310-READ-FUND-PRICE-ROW

              END-READ
           END-PERFORM.


       310-READ-FUND-PRICE-ROW.

           DISPLAY IN-FUND-NBR '-' IN-FUND-NME '-' IN-FUND-COMM-PCT.

      *    SAVE THE FUND TO THE TABLE
           ADD 1 TO WS-FUND-COUNT.
           SET TBL-FUND-NDX TO WS-FUND-COUNT.

           MOVE IN-FUND-NBR TO
               TBL-FUND-NBR(TBL-FUND-NDX).
           MOVE IN-FUND-NME TO
               TBL-FUND-NME(TBL-FUND-NDX).
           MOVE IN-FUND-COMM-PCT TO
               TBL-FUND-COMM-PCT(TBL-FUND-NDX).

      *    SAVE THE FUND'S PRICES TO THE TABLE (PRE ORDERED)
           READ PRICE-FILE
             AT END
                 DISPLAY
                     'FATAL: PRICE FILE ENDED BEFORE FUND FILE'
                 STOP RUN

             NOT AT END

      *      SAVE 3 PRICES
             MOVE IN-FUND-SHR-PRC(1)
               TO TBL-FUND-SHR-PRC(TBL-FUND-NDX, 1)
             MOVE IN-FUND-SHR-PRC(2)
               TO TBL-FUND-SHR-PRC(TBL-FUND-NDX, 2)
             MOVE IN-FUND-SHR-PRC(3)
               TO TBL-FUND-SHR-PRC(TBL-FUND-NDX, 3)

           END-READ.

      *      CHECK
             DISPLAY WS-FUND-COUNT
             ' ' TBL-FUND-NBR(TBL-FUND-NDX)
             '-' TBL-FUND-NME(TBL-FUND-NDX)
             '-' TBL-FUND-COMM-PCT(TBL-FUND-NDX)
             '-' TBL-FUND-SHR-PRC(TBL-FUND-NDX, 1)
             '-' TBL-FUND-SHR-PRC(TBL-FUND-NDX, 2)
             '-' TBL-FUND-SHR-PRC(TBL-FUND-NDX, 3).


       320-PROCESS-SALES-TABLE.

           DISPLAY "PROCESSING SALES".

           MOVE 'N' TO WS-END-OF-FILE.
           PERFORM UNTIL END-OF-FILE
              READ SALES-FILE
                  AT END
                      SET END-OF-FILE TO TRUE
                  NOT AT END

                  PERFORM 330-PROCESS-SALES-RECORD

              END-READ
           END-PERFORM.


       330-PROCESS-SALES-RECORD.

           PERFORM VARYING I FROM 1 BY 1
              UNTIL I > 4 OR SALE-FUND-NBR(I) = ZERO

      *       PRINT HEADERS IF NECESSARY
              IF WS-LINE-COUNT = 0 THEN
                 PERFORM 400-PRINT-COLUMN-HEADINGS
              END-IF

      *       BRANCH AND BORKER ON FIRST SALE
              IF I = 1 THEN
                 MOVE SALE-BRANCH-NME TO WS-DTL-BRANCH-NME
                 MOVE SALE-BROKER-NME TO WS-DTL-BROKER-NME
                 DISPLAY SALE-BRANCH-NME '-' SALE-BROKER-NME
              ELSE
                 MOVE SPACES TO WS-DTL-BRANCH-NME
                 MOVE SPACES TO WS-DTL-BROKER-NME
              END-IF

      *       RESET
              MOVE ZERO TO WS-DTL-SHARE-AMT
              MOVE ZERO TO WS-DTL-COMMISSION-AMT

      *       FIND THE FUND OF THIS SALE
              SEARCH ALL TBL-FUND-ENTRY

      *          NOT FOUND <<>>
                 AT END

                    MOVE SALE-FUND-NBR(I) TO WS-DTL-FUND-NBR
                    MOVE '**** FUND NOT FOUND *****' TO WS-DTL-FUND-NME
                    MOVE SALE-DEP-AMT(I) TO WS-DTL-DEP-AMT
                    MOVE ZERO TO WS-DTL-SHARE-AMT
                    MOVE ZERO TO WS-DTL-COMMISSION-AMT

                    DISPLAY
                      '    *' I ' *** FUND NOT FOUND *** ->'
                      SALE-FUND-NBR(I)

      *          FUND FOUND  >><<
                 WHEN TBL-FUND-NBR(TBL-FUND-NDX) = SALE-FUND-NBR(I)

      *             DEBUG REMOVE LATER ...
                    DISPLAY
                        '    *' I '  ' SALE-FUND-NBR(I)
                        '=' TBL-FUND-NBR(TBL-FUND-NDX)
                        ' ' TBL-FUND-NME(TBL-FUND-NDX)
                        ' ' SALE-SHR-PRC-FLG(I)
                        ' ' SALE-DEP-AMT(I)

                    MOVE TBL-FUND-NBR(TBL-FUND-NDX) TO WS-DTL-FUND-NBR
                    MOVE TBL-FUND-NME(TBL-FUND-NDX) TO WS-DTL-FUND-NME
                    MOVE SALE-DEP-AMT(I) TO WS-DTL-DEP-AMT

               END-SEARCH

               WRITE REPORT-RECORD FROM WS-DETAIL-LINE
               WRITE REPORT-RECORD FROM WS-BLANK-ROW

      *        PAGINATION
               COMPUTE WS-LINE-COUNT =  WS-LINE-COUNT + 2
               IF WS-LINE-COUNT >= 18 THEN
                 MOVE ZERO TO WS-LINE-COUNT
               END-IF

           END-PERFORM.
      *    END LOOP


       400-PRINT-COLUMN-HEADINGS.

           WRITE REPORT-RECORD FROM WS-COLUMN-HEADER-1
           WRITE REPORT-RECORD FROM WS-COLUMN-HEADER-2
           WRITE REPORT-RECORD FROM WS-COLUMN-HYPHENS
           WRITE REPORT-RECORD FROM WS-BLANK-ROW.

           COMPUTE WS-LINE-COUNT =  WS-LINE-COUNT + 4.

       END PROGRAM SALESRPT.


