//LAB4A1 JOB 1
//S1 EXEC PGM=IEFBR14
//PDS DD DSN=EMMA101.LAB4A,DISP=(NEW,CATLG),
// SPACE=(TRK,(1,1,24)),UNIT=DISK,
// LRECL=80,RECFM=FB,BLKSIZE=6080
