//LAB4B1 JOB 1
//S2 EXEC PGM=IEBGENER
//SYSUT1 DD *
//SYSUT2 DD DSN=EMMA101.LAB4B(NEWMEM),DISP=(NEW,CATLG),
// SPACE=(TRK,(1,1,24)),UNIT=SYSDA,
// LRECL=80,RECFM=FB,BLKSIZE=6080
//SYSPRINT DD SYSOUT=*
//*  NO INPUT, SO WE JUST SAY "DUMMY"
//SYSIN    DD  DUMMY
