/*REXX*/
CALL "TSOCLR" 

START:
SAY
SAY "WELCOME TO GRADES PROGRAM "
SAY


STUDENT_COUNT = 0
GRADE_TOTAL = 0
DO FOREVER

 SAY
 SAY "ENTER SUDENTID,GRADE OR E TO END"
 PULL INP

 PARSE VAR INP STUDENTID "," STUDENTGRADE

 /* PARSE STUDENT */
 IF STUDENTID = "E" THEN LEAVE

 IF STUDENTID = "" THEN DO
  SAY "ERROR EMPTY STUDENTID"
  ITERATE
 END

 /* PARSE GRADE */
 IF STUDENTGRADE = "" THEN DO
  SAY "ERROR EMPTY STUDENTGRADE  "
  ITERATE
 END

 IF DATATYPE(STUDENTGRADE, "N") = 0 THEN DO
  SAY "ERROR STUDENTGRADE NOT A NUMBER"
  ITERATE
 END

 IF STUDENTGRADE < 0 | STUDENTGRADE > 4 THEN  DO
  SAY "ERROR INVALID STUDENTGRADE <0 OR >4 "
  ITERATE
 END

 SAY
 SAY "ADDING " STUDENTID "-" STUDENTGRADE
 SAY

 STUDENT_COUNT = STUDENT_COUNT + 1
 GRADE_TOTAL = GRADE_TOTAL + STUDENTGRADE


END /* LOOP END */

IF STUDENT_COUNT = 0 THEN DO
  SAY "NO DATA ENTERED" 
  EXIT 0
END


SAY
SAY "TOTAL STUDENTS: " STUDENT_COUNT
SAY "SUM STUDENTGRADE: " GRADE_TOTAL
SAY "AVG STUDENTGRADE: " GRADE_TOTAL / STUDENT_COUNT
SAY

EXIT 0
