       01  FUND-RECORD.                                                 00010000
           05  IN-FUND-NBR        PIC S9(3).                            00020002
           05  IN-FUND-NME        PIC X(25).                            00030000
           05  IN-FUND-COMM-PCT   PIC S9(3)V9(3).                       00040002
