       01  HIGH-SALES-RECORD.                                           00010000
           05  HS-BROKER-NME         PIC X(25).                         00020000
           05  HS-FUND-NBR           PIC S9(3)       PACKED-DECIMAL.    00030000
           05  HS-SHR-AMT            PIC S9(10)V9(3) PACKED-DECIMAL.    00040000
