       01  SALES-RECORD.                                                00010000
           05  SALE-BRANCH-NME          PIC X(20).                      00020001
           05  SALE-BROKER-NME          PIC X(25).                      00030000
           05  SALE-DETAIL              OCCURS 4                        00040000
                                        INDEXED BY SALE-NDX.            00050000
               10  SALE-FUND-NBR        PIC S9(3).                      00060002
               10  SALE-SHR-PRC-FLG     PIC S9.                         00070002
               10  SALE-DEP-AMT         PIC S9(8)V99.                   00080000
           05                           PIC X.                          00090001
