//GEOFREYA JOB ,'G. DECKER',MSGCLASS=H
//*
//COBOLBTH JCLLIB ORDER=(TRAIN.PROCLIB)
//*
//JSTEP01  EXEC COBL63,MEMBER=TESTIT,
//         SYSINLB='GEOFREY.MLCCOBOL.SOURCE'
//*        PROGLIB='GEOFREY.MLCCOBOL.LOADLIB'
//*
//COB64.SYSIN DD *

       IDENTIFICATION DIVISION.

       PROGRAM-ID. TESTIT.

       ENVIRONMENT DIVISION.


       DATA DIVISION.


       PROCEDURE DIVISION.


           STOP RUN.

/*
//*
//LKED.SYSIN DD *
  NAME TESTIT(R)
/*
//*
//JSTEP02  EXEC PGM=TESTIT,COND=(0,LT)
//*
//STEPLIB  DD DSN=GEOFREY.MLCCOBOL.LOADLIB,DISP=SHR
//*
//*input data set(s)
//*
//*output data set(s)
//*
//SYSUDUMP DD SYSOUT=*
//
